Autodesk.AutoCAD.ApplicationServices.ModelessOperationEventArgs
Provides data for the ModelessOperationEnded and ModelessOperationWillStart events.

Autodesk.AutoCAD.ApplicationServices.ModelessOperationEventArgs.Context
Accesses the current context of the operation.