Autodesk.AutoCAD.ApplicationServices.Document.ModelessOperationWillStart
Wraps the AcEditorReactor.modelessOperationWillStart() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.ModelessOperationEnded
Wraps the AcEditorReactor.modelessOperationEnded() ObjectARX function.