Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureEnabled(Autodesk.AutoCAD.UniqueString)
Returns a Boolean indicating whether a hardware feature is enabled.
feature:  Input input feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureAvailable(Autodesk.AutoCAD.UniqueString)
Returns a Boolean indicating whether a feature is available.
feature:  Input input feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureUsedVal(Autodesk.AutoCAD.UniqueString)
Get the value of the hardware feature.
feature:  Input feature name as string

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureAvailableVal(Autodesk.AutoCAD.UniqueString)
Get the available value for the hardware feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureRecommendedVal(Autodesk.AutoCAD.UniqueString)
Get the recommended value for the hardware feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureUsedVal(Autodesk.AutoCAD.UniqueString,System.Int32)
Set the value of the hardware feature.