Autodesk.AutoCAD.Windows.PaletteSet.AddVisual(System.String,System.Windows.Media.Visual,System.Boolean)
Adds a visual window and controls whether the content is resized to the palette.
name:  Input palette name
control:  Input visual control
bResizeContentToPaletteSize:  Input Boolean that determines whether the content should be resized to fit the palette

Autodesk.AutoCAD.Windows.PaletteSet.AddVisualBrowser(System.String,System.Windows.Media.Visual,System.String,System.String,System.Boolean)
Adds a visual browser control to a palette. Note: Related to the Blocks palette.
name:  Input palette name
control:  Input visual control
htmlPage:  Input string that indicates the HTML page to load
scriptableName:  Input string that sets the name for the control to use in a script
bShowBrowserFirst:  Input Boolean that specifies whether the HTML page should be displayed

Autodesk.AutoCAD.Windows.PaletteSet.switchVisualBrowser(System.Int32,System.Boolean)
Switches the current tab to a specific tab and controls the display of the content on the tab. Note: Related to the Blocks palette.
index:  Input integer that references which tab to set current
bVisual:  Input Boolean that controls whether the content is displayed