Autodesk.AutoCAD.Windows.OpenFileOrFolderDialog
This is class Autodesk.AutoCAD.Windows.OpenFileOrFolderDialog.

Autodesk.AutoCAD.Windows.OpenFileOrFolderDialog.#ctor(System.String,System.String,System.String,System.String,Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags)
This is OpenFileOrFolderDialog, a member of class OpenFileOrFolderDialog.

Autodesk.AutoCAD.Windows.OpenFileOrFolderDialog.ShowDialog
This is ShowDialog, a member of class OpenFileOrFolderDialog.

Autodesk.AutoCAD.Windows.OpenFileOrFolderDialog.FileOrFoldername
This is FileOrFoldername, a member of class OpenFileOrFolderDialog.